{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Домашнее задание к лекции \"Функции\" Вам нужно помочь секретарю автоматизировать работу. Для этого нужно написать программу, которая будет на основе хранимых данных исполнять пользовательские команды.\n",
    "\n",
    "Общие требования к программе:\n",
    "\n",
    "код должен быть грамотно декомпозирован (каждая функция отвечает за свою конкретную задачу, дублирующийся функционал переиспользуется, а его код не повторяется); в коде отсутствуют глобальные переменные (за исключением documents и directories); пользовательский ввод обрабатывается в цикле while до тех пор, пока пользователь явно не завершит программу (вводом команды \"q\").\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# перечень всех документов\n",
    "documents = [ \n",
    "    {'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'}, \n",
    "    {'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'}, \n",
    "    {'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'} \n",
    "]\n",
    "# перечень полок, на которых хранятся документы (если документ есть в)\n",
    "directories = { \n",
    "    '1': ['2207 876234', '11-2'], \n",
    "    '2': ['10006'], \n",
    "    '3': [] \n",
    "} \n",
    "\n",
    "\n",
    "def owner_by_number():\n",
    "    \"\"\"\"\n",
    "    Пользователь может узнать владельца документа по его номеру\n",
    "    \"\"\"\n",
    "    match = 0\n",
    "    user_input = input('Введите номер документа: ')\n",
    "    for element in documents:\n",
    "        if user_input == element['number']:\n",
    "            match = 1\n",
    "            owner = element['name']\n",
    "            result_yes = f'Владелец документа: {owner}'\n",
    "        else:\n",
    "            result_no = 'Документ не найден в базе'\n",
    "    if match != 0:\n",
    "        print(result_yes)\n",
    "    else:\n",
    "        print(result_no)\n",
    "\n",
    "# owner_by_number()\n",
    "\n",
    "def shelf_by_number():\n",
    "    \"\"\"\n",
    "    Пользователь может по номеру документа узнать на какой полке он хранится\n",
    "    \"\"\"\n",
    "    match_doc = 0\n",
    "    user_input = input('Введите номер документа: ')\n",
    "    for element in documents:\n",
    "        if user_input == element['number']:\n",
    "            match_doc = 1\n",
    "            for shelf, number_list in directories.items():\n",
    "                for num in number_list:\n",
    "                    if num == element['number']:\n",
    "                        result_shelf = f'Документ хранится на полке:{shelf}'\n",
    "    if match_doc != 0:\n",
    "        print(result_shelf)\n",
    "    else:\n",
    "        print('Документ не найден в базе')\n",
    "\n",
    "# shelf_by_number()\n",
    "\n",
    "def all_info():\n",
    "    \"\"\"\n",
    "    Пользователь может увидеть полную информацию по всем документам\n",
    "    \"\"\"\n",
    "    for person in documents:\n",
    "        for element in person:\n",
    "            number = person['number']\n",
    "            doc_type = person['type']\n",
    "            owner_name = person['name']\n",
    "            result = f'№: {number}, тип: {doc_type}, владелец: {owner_name},'\n",
    "            for shelf, number_list in directories.items():\n",
    "                for number in number_list:\n",
    "                    res_shelf = f'полка хранения:{shelf}'\n",
    "        print(result, res_shelf)\n",
    "        \n",
    "# all_info()\n",
    "\n",
    "def add_new_shelf():\n",
    "    \"\"\"\n",
    "    Пользователь может добавить новую полку\n",
    "    \"\"\"\n",
    "    user_input = input('Введите номер полки, которую хотите добавить: ')\n",
    "    shelves_list = list(directories.keys())\n",
    "    if user_input in directories:\n",
    "        print('Такая полка уже существует. Текущий перечень полок: ', end='')\n",
    "        print(*shelves_list, sep= ', ')\n",
    "    else:\n",
    "        directories[user_input] = []\n",
    "        shelves_list = list(directories.keys())\n",
    "        print('Полка добавлена. Текущий перечень полок: ', end='')\n",
    "        print(*shelves_list, sep= ', ')\n",
    "        \n",
    "# add_new_shelf()\n",
    "\n",
    "def delete_empty_shelf():\n",
    "    \"\"\"\n",
    "    Пользователь может удалить существующую полку из данных (только если она пустая)\n",
    "    \"\"\"\n",
    "    user_input = input('Введите номер полки, которую хотите удалить: ')\n",
    "    if user_input in directories and len(directories[user_input]) == 0:\n",
    "        del(directories[user_input])\n",
    "        print('Полка удалена. Текущий перечень полок: ', end='')\n",
    "        shelves_list = list(directories.keys())\n",
    "        print(*shelves_list, sep= ', ')\n",
    "    elif user_input in directories and len(directories[user_input]) != 0:\n",
    "        print(directories[user_input])\n",
    "        print('На полке есть документы, удалите их перед удалением полки. Текущий перечень полок: ', end='')\n",
    "        shelves_list = list(directories.keys())\n",
    "        print(*shelves_list, sep= ', ')\n",
    "    else:\n",
    "        print('Такой полки не существует. Текущий перечень полок: ', end='')\n",
    "        shelves_list = list(directories.keys())\n",
    "        print(*shelves_list, sep= ', ')\n",
    "        \n",
    "# delete_empty_shelf()\n",
    "\n",
    "def main(documents, directories):\n",
    "    \"\"\"\n",
    "    Пользователь программы:\n",
    "    - по команде \"p\" может узнать владельца документа по его номеру\n",
    "    - по команде \"s\" может по номеру документа узнать на какой полке он хранится\n",
    "    - по команде \"l\" может увидеть полную информацию по всем документам\n",
    "    - по команде \"as\" может добавить новую полку\n",
    "    - по команде \"ds\" может удалить существующую полку из данных (только если она пустая)\n",
    "    - может завершить программу вводом команды \"q\"\n",
    "    \n",
    "    \"\"\"\n",
    "    while True:\n",
    "        user_input = input('Введите команду: ')\n",
    "        if user_input == 'p':\n",
    "            owner_by_number()\n",
    "        elif user_input == 's':\n",
    "            shelf_by_number()\n",
    "        elif user_input == 'l':\n",
    "            all_info()\n",
    "        elif user_input == 'as':\n",
    "            add_new_shelf()\n",
    "        elif user_input == 'ds':\n",
    "            delete_empty_shelf()\n",
    "        elif user_input == 'q':\n",
    "            print('Работа программы завершена')\n",
    "            break  \n",
    "            \n",
    "main(documents, directories)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
